ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wdev-pwr.xml
<?xml version="1.0" encoding="utf-8"?>
<openEspRadioPeripheralFragment id="WDEV_PWR">
    <peripheral>
      <name>PHY_COLD_DEADLINE_ORACLE</name>
      <description>
        SOURCE[ROM_REV0_PHY_WAIT_I2C_SDM_STABLE];
        CONFIDENCE[instruction-exact-semantics-unknown].
        Free-running word sampled by the complete rev0 ROM SDM-stability
        deadline. The instruction body proves its address and unsigned
        wraparound consumer, but not its hardware clock source.
      </description>
      <baseAddress>0x2010d800</baseAddress>
      <registers>
        <register>
          <name>DEADLINE_COUNTER_UNKNOWN</name>
          <description>SOURCE[ROM_REV0_PHY_WAIT_I2C_SDM_STABLE]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_wait_i2c_sdm_stable samples this full word before and after each independently completed PHY-I2C read.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>SOURCE[ROM_REV0_PHY_WAIT_I2C_SDM_STABLE]; CONFIDENCE[instruction-exact]. Full-width wrapping deadline value.</description>
              <bitOffset>0</bitOffset><bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_REGDMA_CONTROL</name>
      <description>SOURCE[BLOB_LIBPP_MAC_CHANNEL_SWITCH,BLOB_LIBPP_HAL_PWR,HIL_OPEN_REGDMA_LINK4_2026_07_29]; CONFIDENCE[instruction-exact-partial]. Shared WDEVPWR control word. The channel-change leaf proves the REGDMA selector, while complete modem-power leaves prove the wake-protect lead time and TBTT auto-period fields. Hardware interactions between these fields remain unqualified.</description>
      <baseAddress>0x2010d83c</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_MAC_CHANNEL_SWITCH,BLOB_LIBPP_HAL_PWR,HIL_OPEN_REGDMA_LINK4_2026_07_29]; CONFIDENCE[instruction-exact-partial]. Shared REGDMA and modem wakeup configuration word. Every promoted field has a complete independent setter; their combined hardware lifecycle is not inferred.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>MODEM_WAKEUP_PROTECT_EARLY_TIME</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact]. pwr_hal_set_mac_modem_state_wakeup_protect_early_time replaces the low sixteen bits.</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xffff</maximum></range></writeConstraint></field>
            <field><name>LOW_CONTROL_UNKNOWN</name><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ACTIVE_LINK</name><description>SOURCE[BLOB_LIBPP_MAC_CHANNEL_SWITCH,HIL_OPEN_REGDMA_LINK4_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Four-bit Wi-Fi MAC REGDMA link selector; the active no-power-save channel restart writes four. Leaving zero after retuning caused intermittent authentication ACK timeouts.</description><bitOffset>17</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>MODEM_TBTT_AUTO_PERIOD_INTERVAL</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. pwr_hal_set_mac_modem_tbtt_auto_period_interval replaces bits 30:21 from the low ten argument bits.</description><bitOffset>21</bitOffset><bitWidth>10</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0x3ff</maximum></range></writeConstraint></field>
            <field><name>MODEM_TBTT_AUTO_PERIOD_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. The dedicated enable and disable leaves set or clear bit 31.</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TSF_STATUS</name>
      <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Station TSF activity status recovered from the complete no-call hal_is_sta_tsf_active leaf. The instruction body proves the address and bit geometry but not the hardware transition rules.</description>
      <baseAddress>0x2010d80c</baseAddress>
      <registers>
        <register>
          <name>STATUS</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_is_sta_tsf_active returns bit zero.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>STATION_ACTIVE</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_STA_TBTT_TARGET</name>
      <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Station TBTT target word recovered from complete hal_set_sta_tbtt. The low 26-bit packing from the supplied 64-bit TSF value is exact; the hardware counter unit remains unnamed.</description>
      <baseAddress>0x2010d82c</baseAddress>
      <registers>
        <register>
          <name>TARGET</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_set_sta_tbtt replaces bits 25:0 with bits 35:10 of the supplied station TSF value and preserves the high six bits.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>TSF_BITS_35_10</name><bitOffset>0</bitOffset><bitWidth>26</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_STA_TSF_LOAD</name>
      <description>SOURCE[BLOB_LIBPP_HAL_TSF,ROM_REV0_HAL_GET_STA_TSF]; CONFIDENCE[instruction-exact]. Shared station TSF load and coherent snapshot transaction.</description>
      <baseAddress>0x2010d814</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF,ROM_REV0_HAL_GET_STA_TSF]; CONFIDENCE[instruction-exact]. Complete hal_set_sta_tsf asserts bit four after writing both station TSF value words; complete hal_get_sta_tsf sets then clears bit zero around its snapshot reads.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>SNAPSHOT_STATION_TSF</name><description>SOURCE[ROM_REV0_HAL_GET_STA_TSF]; CONFIDENCE[instruction-exact]. Complete hal_get_sta_tsf sets this bit before either station TSF word is sampled and clears it after the optional reads.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LOAD_STATION_TSF</name><description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. Station TSF load request asserted by the final fresh-read RMW in hal_set_sta_tsf.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>VALUE_LOW</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. Low 32 bits written first by complete hal_set_sta_tsf.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xffffffff</maximum></range></writeConstraint></field></fields>
        </register>
        <register>
          <name>VALUE_HIGH</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. High 32 bits written second by complete hal_set_sta_tsf.</description>
          <addressOffset>0x08</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xffffffff</maximum></range></writeConstraint></field></fields>
        </register>
        <register>
          <name>SNAPSHOT_LOW</name>
          <description>SOURCE[ROM_REV0_HAL_GET_STA_TSF]; CONFIDENCE[instruction-exact]. Coherently latched low 32 bits conditionally read by complete hal_get_sta_tsf.</description>
          <addressOffset>0x0c</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>SNAPSHOT_HIGH</name>
          <description>SOURCE[ROM_REV0_HAL_GET_STA_TSF]; CONFIDENCE[instruction-exact]. Coherently latched high 32 bits conditionally read by complete hal_get_sta_tsf.</description>
          <addressOffset>0x10</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
