ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wdev-pwr.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RTC_TIMER_UPDATE</name>
      <description>SOURCE[BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact-partial]. Complete enabled path of hal_timer_update_by_rtc, reached from complete hal_init with enable one and the OS-adapter slow-clock calibration value.</description>
      <baseAddress>0x2010d830</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_INIT_TAIL,BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. Enabled hal_timer_update_by_rtc sets bit 27. hal_set_sta_tsf_wakeup sets or clears bit 21 together with the STA TSF wakeup bit at 0x2010d858.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>

            <field><name>STA_TSF_WAKEUP_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. hal_set_sta_tsf_wakeup sets or clears this bit in the same branch as STA_TSF_CONTROL.STA_TSF_WAKEUP_ENABLE.</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>RTC_UPDATE_ENABLE_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact]. Set when the leaf's enable argument is nonzero.</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>

          </fields>
        </register>
        <register>
          <name>SOC_WAKEUP_CLEAR</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME,BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_tsf_clear_soc_wakeup_request sets bit 30. Complete modem-power leaves independently expose status bits and clear pulses in this shared word; hardware transition behavior is not inferred.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>BEACON_FILTER_FORCE_SYNC_LIMIT</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. The dedicated setter replaces bits 9:0.</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field>
            <field><name>BEACON_FILTER_FORCE_SYNC_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. Dedicated enable/disable leaves set or clear bit 10.</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BEACON_FILTER_FORCE_DUMP_LIMIT</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. The dedicated setter replaces bits 17:11.</description><bitOffset>11</bitOffset><bitWidth>7</bitWidth></field>
            <field><name>BEACON_FILTER_FORCE_DUMP_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. Dedicated enable/disable leaves set or clear bit 21.</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLEAR_BEACON_SLEEP_COUNTER</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. Dedicated clear leaf sets bit 28.</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLEAR_BEACON_MISS_COUNTER</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. Dedicated clear leaf sets bit 29.</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLEAR_REQUEST</name><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLEAR_BEACON_INFO</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. Dedicated clear leaf sets bit 31.</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>MODEM_SLEEP_LIMIT_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete no-call setters prove two bounded modem counters and their independent limit-exceeded wake gates. Units and hardware transition behavior remain unknown.</description>
          <addressOffset>0x08</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>BEACON_MISS_LIMIT</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact]. Low four argument bits published by pwr_hal_set_mac_modem_beacon_miss_limit.</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xf</maximum></range></writeConstraint></field>
            <field><name>BEACON_MISS_LIMIT_WAKEUP_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. Dedicated enable/disable leaves set or clear bit four.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MODEM_STATE_SLEEP_LIMIT</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact]. Low ten argument bits published in bits 14:5 by pwr_hal_set_mac_modem_state_sleep_limit.</description><bitOffset>5</bitOffset><bitWidth>10</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0x3ff</maximum></range></writeConstraint></field>
            <field><name>MODEM_STATE_SLEEP_LIMIT_WAKEUP_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. Dedicated enable/disable leaves set or clear bit fifteen.</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>STA_LIGHT_SLEEP_WAKE_AHEAD</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact]. Complete hal_set_sta_light_sleep_wake_ahead_time replaces the high sixteen bits. Complete hal_set_sta_tbtt independently publishes its fifth argument to the same field.</description>
          <addressOffset>0x10</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>TIME</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields>
        </register>
        <register>
          <name>RX_BEACON_TIME_LOW</name>
          <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME,BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact-partial]. Complete hal_set_rx_beacon_time and pwr_hal_set_mac_modem_beacon_miss_timeout independently replace the same low sixteen bits. The mode-dependent hardware interpretation is not inferred.</description>
          <addressOffset>0x24</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xffff</maximum></range></writeConstraint></field></fields>
        </register>
        <register>
          <name>STA_TSF_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF,BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact]. Shared STA TSF scheduler and modem-state wakeup control word used by hal_enable_sta_tsf, hal_disable_sta_tsf, hal_set_sta_tsf_wakeup, and the wakeup-protect enable/disable leaves.</description>
          <addressOffset>0x28</addressOffset><size>32</size><access>read-write</access>
          <fields>

            <field>
              <name>STA_TSF_MODE</name>
              <description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. hal_enable_sta_tsf replaces bits 22:19 with one; hal_disable_sta_tsf clears them.</description>
              <bitOffset>19</bitOffset><bitWidth>4</bitWidth>
              <writeConstraint><useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
              <enumeratedValues>
                <name>StaTsfMode</name>
                <usage>read-write</usage>
                <enumeratedValue><name>DISABLED</name><value>0</value></enumeratedValue>
                <enumeratedValue><name>ENABLED</name><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>

