ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wdev-pwr.xml
            <field><name>MODEM_STATE_WAKEUP_PROTECT_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact]. pwr_hal_set_mac_modem_state_wakeup_protect_enable sets this bit and the corresponding disable leaf clears it.</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>STA_TSF_ENABLE_LOW</name><description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. hal_enable_sta_tsf sets this bit and hal_disable_sta_tsf clears it.</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>STA_TSF_WAKEUP_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. hal_set_sta_tsf_wakeup sets or clears this bit together with WIFI_MAC_RTC_TIMER_UPDATE.CONTROL.STA_TSF_WAKEUP_ENABLE.</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>STA_TSF_ENABLE_HIGH</name><description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. hal_enable_sta_tsf sets this bit and hal_disable_sta_tsf clears it.</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>STA_TBTT_INTERVAL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_set_sta_tbtt_interval replaces the low 22 bits from argument bits 31:10. Complete hal_set_sta_tbtt performs the same update from its third argument.</description>
          <addressOffset>0x2c</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>INTERVAL_BITS_31_10</name><bitOffset>0</bitOffset><bitWidth>22</bitWidth></field></fields>
        </register>
        <register>
          <name>SLOW_CLOCK_CALIBRATION</name>
          <description>SOURCE[BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact]. Enabled hal_timer_update_by_rtc replaces bits 17:0 with the low eighteen bits returned by g_wifi_osi_funcs._slowclk_cal_get.</description>
          <addressOffset>0x48</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>VALUE</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact]. Low eighteen bits of the OS-adapter calibration value.</description><bitOffset>0</bitOffset><bitWidth>18</bitWidth></field>

          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_AUX_TSF_CONTROL</name>
      <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. SoftAP, NAN and broadcast-TWT TSF control words. Complete public leaves prove their addresses and exact enable/mode masks; unrelated bits and hardware transition rules remain unnamed.</description>
      <baseAddress>0x2010d860</baseAddress>
      <registers>
        <register>
          <name>SOFTAP_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_disable_softap_tsf clears bits 31:30. Generic TSF enable/disable leaves independently identify bit 31 as the domain enable; bit 30 remains unknown.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>HIGH_CONTROL_UNKNOWN</name><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TSF_ENABLE</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>NAN_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete NAN enable/disable leaves use the same two-stage gate and mode transaction as station TSF at this distinct word.</description>
          <addressOffset>0x08</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>TSF_MODE</name><bitOffset>19</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>TSF_ENABLE_LOW</name><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TSF_ENABLE_HIGH</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>BTWT_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_enable_sta_btwt_tsf enables or disables the broadcast-TWT TSF domain using the same gate and mode masks as station TSF.</description>
          <addressOffset>0x10</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>TSF_MODE</name><bitOffset>19</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>TSF_ENABLE_LOW</name><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TSF_ENABLE_HIGH</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TSF_TIMER</name>
      <description>SOURCE[BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. Four-entry TSF timer bank recovered from all complete target, wakeup and enable/disable leaves. Each entry consists of one control word followed by its 32-bit target. The public index is guarded to zero through three by the target and timer-enable leaves; the dedicated wakeup leaves do not contain their own range check.</description>
      <baseAddress>0x2010d87c</baseAddress>
      <registers>
        <register><dim>4</dim><dimIncrement>0x08</dimIncrement><dimIndex>0-3</dimIndex>
          <name>CONTROL%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact-semantics-unknown]. Per-timer control word at 0x2010d87c + index*8. Complete target accessors replace and return the low three bits; the exact semantics of that field remain unknown. Dedicated leaves set or clear wakeup bit 30, while the timer enable/disable leaves set or clear bit 31.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>LOW_CONTROL_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_tsf_timer_set_target replaces these bits from its third argument and hal_tsf_timer_get_target returns them through its second output pointer.</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>WAKEUP_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. Set by hal_enable_tsf_timer_wakeup and cleared by hal_disable_tsf_timer_wakeup.</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIMER_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. Set by hal_enable_tsf_timer and cleared by hal_disable_tsf_timer.</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register><dim>4</dim><dimIncrement>0x08</dimIncrement><dimIndex>0-3</dimIndex>
          <name>TARGET%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. Full 32-bit timer target written by hal_tsf_timer_set_target and returned through the first output pointer by hal_tsf_timer_get_target.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
