ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wdev-pwr.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_COEX_RUNTIME</name>
      <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Runtime receive-beacon and individual-TWT COEX/PTI words recovered from five complete hal_coex.o leaves. Register addresses, masks and RMW order are exact; fields whose electrical meaning is not established retain UNKNOWN names.</description>
      <baseAddress>0x2010d89c</baseAddress>
      <registers>
        <register>
          <name>CLEAR_REQUEST</name>
          <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_clear_rx_beacon_pti sets bit zero through a fresh-read RMW. Complete hal_clr_itwt_pti sets the input-selected bit through the same word; the accepted index domain and remaining bit identities are not inferred.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>REQUESTS_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>RX_BEACON_TIME_HIGH</name>
          <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME]; CONFIDENCE[instruction-exact]. Complete hal_set_rx_beacon_time replaces the low byte from bits 15:8 of its second argument after updating WIFI_MAC_RTC_TIMER_UPDATE.RX_BEACON_TIME_LOW.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields>
        </register>
        <register>
          <name>ITWT_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_set_itwt_pti clears the low byte and then writes seqz(argument zero) into bit zero. The remaining low-byte semantics are unknown.</description>
          <addressOffset>0x08</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>LOW_CONTROL_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields>
        </register>
        <register>
          <name>SHARED_RX_PTI</name>
          <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Shared low-nibble PTI word updated from the second argument by complete hal_set_rx_beacon_pti and hal_set_itwt_pti.</description>
          <addressOffset>0x0c</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>PTI</name><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
        <register>
          <name>RX_BEACON_PTI</name>
          <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME]; CONFIDENCE[instruction-exact]. Complete hal_set_rx_beacon_pti replaces bits 15:12 from the low nibble of its first argument.</description>
          <addressOffset>0x10</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>PTI</name><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_POWER_INTERRUPT</name>
      <description>SOURCE[BLOB_LIBPP_ISR_REGISTER_DUMP,BLOB_LIBPP_HAL_PWR_INTERRUPT,BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. WDEVPWR interrupt bank named by complete print_isr_regs. Complete hal_pwr_interrupt_get_event and hal_pwr_interrupt_clr_event independently prove the masked STATUS read and full-width CLEAR acknowledgement transaction. Complete TSF timer enable/disable leaves update the timer interrupt masks in ENABLE and clear stale events through CLEAR.</description>
      <baseAddress>0x2010d8b4</baseAddress>
      <registers>
        <register><name>ENABLE</name><description>SOURCE[BLOB_LIBPP_ISR_REGISTER_DUMP,BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. WDEVPWR_ENABLE diagnostic snapshot and writable event mask. hal_enable_tsf_timer sets bit 7-index and hal_disable_tsf_timer clears the same bit for guarded timer indices zero through three.</description><addressOffset>0x00</addressOffset><size>32</size><access>read-write</access><fields><field><name>EVENT_MASK</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>RAW</name><description>WDEVPWR_RAW diagnostic snapshot.</description><addressOffset>0x04</addressOffset><size>32</size><access>read-only</access><fields><field><name>EVENTS</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>STATUS</name><description>SOURCE[BLOB_LIBPP_ISR_REGISTER_DUMP,BLOB_LIBPP_HAL_PWR_INTERRUPT]; CONFIDENCE[instruction-exact]. Masked WDEVPWR event image returned by complete hal_pwr_interrupt_get_event.</description><addressOffset>0x08</addressOffset><size>32</size><access>read-only</access><fields><field><name>EVENTS</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>CLEAR</name><description>SOURCE[BLOB_LIBPP_HAL_PWR_INTERRUPT,BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. Full event image stored by complete hal_pwr_interrupt_clr_event to acknowledge WDEVPWR events. hal_enable_tsf_timer performs a fresh-read RMW which asserts bit 7-index here before enabling the selected timer.</description><addressOffset>0x0c</addressOffset><size>32</size><access>read-write</access><modifiedWriteValues>oneToClear</modifiedWriteValues><fields><field><name>EVENTS</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
      </registers>
    </peripheral>
</openEspRadioPeripheralFragment>
